Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: The following example defines two classes, Customer and CreditCard, which model a bank customer and a possible credit card for that customer.
ja: 以下の例は２つのクラス、CustomerとCreditCardを定義します、それは、銀行顧客とその顧客のために可能なクレジットカードをモデル化します。

source: The following example explicitly declares the conditional conformance of Array to Loggable to avoid a conflict when declaring its conditional conformance to both TitledLoggable and the new MarkedLoggable protocol.
ja: 以下の例は、Loggableに対してのArrayの条件準拠を明示的に宣言して、TitledLoggableと新しいMarkedLoggableプロトコルの両方に対してのそれの条件準拠を宣言する時に衝突を回避します。

source: The following example extends the generic Stack type to add a read-only computed property called topItem, which returns the top item on the stack without popping it from the stack:
ja: 以下の例は総称体Stack型を拡張して、topItemと呼ばれる読み出し専用の計算プロパティを加えます、それは、スタックの一番上の項目をスタックからそれをポップすることなく返します：

source: The following example removes all vowels and spaces from a lowercase string to create a cryptic puzzle phrase:
ja: 以下の例は、秘密の謎の語句をつくるために、小文字の文字列から全ての母音と空白を削除します：

source: The following example replaces "Chocolate Spread", "Cheese", and "Butter" with "Bananas" and "Apples":
ja: 以下の例は、"Chocolate Spread"、"Cheese"、そして"Butter"を、"Bananas"および"Apples"と取り替えます：

source: The following example reports a compile-time error:
ja: 以下の例は、コンパイル時エラーを報告します：

source: The following example shows a string literal and a string delimited by extended delimiters that create equivalent string values:
ja: 以下の例は、文字列リテラルそして同等の文字列値を作成する拡張区切り記号によって区切られる文字列を示します。

source: The following example shows designated initializers, convenience initializers, and automatic initializer inheritance in action.
ja: 以下の例は、指定イニシャライザ、便宜イニシャライザ、そして自動的なイニシャライザ継承の動作を示します。

source: The following example shows the behavior of the example above without using optional chaining.
ja: 以下の例は、オプショナル連鎖を使うことなく上の例の挙動を示します。

source: The following example shows the difference in behavior between an optional string and an implicitly unwrapped optional string when accessing their wrapped value as an explicit String:
ja: 以下の例は、オプショナルの文字列と、暗黙的にアンラップされるオプショナルの文字列の間での、それらのラップされた値に明示的なStringとしてアクセスする場合での挙動の違いを示します：

source: The following example switches on a Character value and determines whether it represents a number symbol in one of four languages.
ja: 以下の例は、あるCharacter値に基づいて切り替えて、それが数字シンボルを４つの言語のうちの１つで表わすかどうかを明らかにします。

source: The following example switches over all three existing cases of the standard library’s Mirror.AncestorRepresentation [https://developer.apple.com/documentation/swift/mirror/ancestorrepresentation] enumeration.
ja: 以下の例は、標準ライブラリのもつMirror.AncestorRepresentation [https://developer.apple.com/documentation/swift/mirror/ancestorrepresentation]列挙の３つの既存のケース節すべてに対してスイッチします。

source: The following example uses the break and continue statements with a labeled while loop for an adapted version of the Snakes and Ladders game that you saw earlier in this chapter.
ja: 以下の例は、breakとcontinue文をラベルが付いたwhileループと一緒に、あなたがこの章で以前に見た「ヘビとはしご」ゲームの改作板のために使います。

source: The following extension makes Array instances conform to the TextRepresentable protocol whenever they store elements of a type that conforms to TextRepresentable.
ja: 以下の拡張は、ArrayインスタンスをTextRepresentableプロトコルに準拠させます、それがTextRepresentableに準拠する型の要素を格納する時は必ずです。

source: The following form declares a computed variable or computed property:
ja: 以下の形式は、計算変数または計算プロパティを宣言します：

source: The following form declares a new infix operator:
ja: 以下の形式は、新しい接中辞演算子を宣言します：

source: The following form declares a new postfix operator:
ja: 以下の形式は、新しい接尾辞演算子を宣言します：

source: The following form declares a new prefix operator:
ja: 以下の形式は、新しい接頭辞演算子を宣言します：

source: The following form declares a stored variable or stored variable property:
ja: 以下の形式は、格納変数または格納変数プロパティを宣言します：

source: The following form declares an enumeration type that contains enumeration cases of any type:
ja: 以下の形式は、随意の型の列挙ケース節を含む列挙型を宣言します：

source: The following form declares an enumeration type that contains enumeration cases of the same basic type:
ja: 以下の形式は、同じ基本の型をもつ列挙ケース節たちを含む列挙型を宣言します：

source: The following form declares initializers for structures, enumerations, and designated initializers of classes:
ja: 以下の形式は、構造体、列挙のイニシャライザ、そしてクラスの指定イニシャライザを宣言します：

source: The following function calls are equivalent:
ja: 以下の関数呼び出しは、等しいです：

source: The following keywords are reserved and can’t be used as identifiers, unless they’re escaped with backticks, as described above in Identifiers.
ja: 上の識別子で記述されるように、以下のキーワードは予約済で、それらがバッククォートでエスケープされない限り、識別子として使われることはできません。

source: The following requirements are placed on the function’s two type parameters:
ja: 以下の要件は、この関数の持つ２つの型パラメータ上に置かれます：

source: The following statement is not valid:
ja: 以下の文は、有効ではありません：

source: The following tokens are reserved as punctuation and can’t be used as custom operators: (, ), {, }, [, ], ., ,, :, ;, =, @, #, & (as a prefix operator), ->, `, ?, and ! (as a postfix operator).
ja: 以下のトークンは、句読点として予約されます、そしてあつらえの演算子として使われることができません：(, ), {, }, [, ], ., ,, :, ;, =, @, #, &（接頭辞演算子として）, ->, `, ?, そして!（接尾辞演算子として）。

source: The forced form, as!, attempts the downcast and force-unwraps the result as a single compound action.
ja: 強制形式as!は、一回の複合動作として、ダウンキャストとその結果の強制アンラップを試みます。

source: The four function calls marked “Error” in the example above cause compiler errors.
ja: 上の例において「Error」と記される４つの関数呼び出しは、コンパイラエラーを引き起こします。

source: The fourth codeUnit value (8252) is a decimal equivalent of the hexadecimal value 203C, which represents the Unicode scalar U+203C for the DOUBLE EXCLAMATION MARK character.
ja: ４番目のcodeUnit値（8252）は、16進数の値203Cです、それは、DOUBLE EXCLAMATION MARK文字に対するユニコード・スカラーU+203Cを表わします。

source: The fourth codeUnit value (8252) is again a decimal equivalent of the hexadecimal value 203C, which represents the Unicode scalar U+203C for the DOUBLE EXCLAMATION MARK character.
ja: ４番目のcodeUnit値（8252）は、ふたたび16進数値203Cの10進の等価物です、それは、DOUBLE EXCLAMATION MARK文字に対するユニコード・スカラーU+203Cを表わします。

source: The function call is understood to be a call to one of the specially named methods on that instance.
ja: 関数呼び出しは、そのインスタンス上での特殊名メソッドの１つへの呼び出しであると理解されます。

source: The function definition still needs parentheses after the function’s name, even though it does not take any parameters.
ja: たとえそれが全くパラメータをとらないとしても、関数定義は依然として関数の名前の後に丸括弧を必要とします。

source: The function in the example below is called greet(person:), because that’s what it does—it takes a person’s name as input and returns a greeting for that person.
ja: 下記の例の関数は、それがすることから、greet(person:)と呼ばれます ― それは、入力としてある人の名前をとって、その人のために挨拶を返します。

source: The function it returns has no parameters, and returns an Int value each time it is called.
ja: それが返す関数は、パラメータを持たず、それが呼ばれるたびにInt値を返します。

source: The function name is also followed by an empty pair of parentheses when the function is called.
ja: その関数が呼ばれるとき、関数名の後にまた空の丸括弧の対が続きます。

source: The function performs this swap by storing the value of a in a temporary constant called temporaryA, assigning the value of b to a, and then assigning temporaryA to b.
ja: 関数はこの交換を、aの値をtemporaryAと呼ばれる一時的な定数の中に格納して、bの値をaに代入して、それからtemporaryAをbに代入することによって実行します。

source: The function prints “Function was called” before returning a value, which lets you see whether the right-hand side of the = operator was evaluated.
ja: この関数は、値を返す前に「Function was called（関数は呼び出された）」を出力します、それはあなたに=演算子の右手側が評価されたかどうかを確かめさせます。

source: The function returns a Boolean value of true if all items match and a value of false if they don’t.
ja: この関数は全ての項目が合致するならばブール値のtrueを、それらがそうしないならばfalseの値を返します。

source: The function returns a tailored greeting in each case.
ja: 関数は、それぞれの状況に合った挨拶を返します。

source: The function returns after it starts the operation, but the closure isn’t called until the operation is completed—the closure needs to escape, to be called later.
ja: 関数は、それが演算を開始した後に戻ります、しかしクロージャはその演算が完了されるまで呼び出されません—このクロージャは脱出する、後で呼び出される、必要があります。

source: The function then considers the value of integerToDescribe using a switch statement.
ja: 関数は、それからswitch文を使ってintegerToDescribeの値を考慮します。

source: The function then iterates over the remaining values in the array and checks each value to see if it is smaller or larger than the values of currentMin and currentMax respectively.
ja: この関数はそれから、配列の残りの値すべてに渡って繰り返します、そして各値をそれがcurrentMinおよびcurrentMaxの値より小さいかより大きいかそれぞれについて調べます。

source: The function value carries no context and uses the C calling convention.
ja: 関数値は、コンテキストを持ち運びません、そしてC呼出規約を使います。

source: The function value is represented as a reference to the block object, which is an id-compatible Objective-C object that embeds its invocation function within the object.
ja: この関数値はそのブロックオブジェクトへの参照として表現されます、それはid互換Objective-Cオブジェクトで、それの呼出関数がそのオブジェクト内部に埋め込まれます。

source: The functions in the following code both return a value of some type that conforms to the Shape protocol.
ja: 以下のコードでの関数は両方とも、Shapeプロトコルに準拠する何らかの型の値を返します。

source: The function’s return type is a tuple type composed from two of the custom classes defined above in Custom Types.
ja: この関数の戻り型は、上のあつらえの型で定義されるあつらえのクラスのうちの２つから作られるタプル型です。

source: The game board is represented by an array of Int values.
ja: ゲーム盤は、Int値の配列によって表されます。

source: The game board is the same as before.
ja: ゲーム盤は、前と同じものです。

source: The generic where clause in the example above requires Item to conform to a protocol, but you can also write a generic where clauses that require Item to be a specific type.
ja: 上の例の総称体where節は、Itemに要求してあるプロトコルに準拠させます、しかしあなたはまたItemに特定の型であることを要求する総称体where節を書くことができます。

source: The generic where clause on Iterator requires that the iterator must traverse over elements of the same item type as the container’s items, regardless of the iterator’s type.
ja: この総称体where節がIterator上で要求するのは、そのイテレータがコンテナのもつ要素と同じ項目型の要素に対して見ていくことです、そのイテレータの持つ型に関係なく。

source: The generic where clause requires that the iterator for the sequence must traverse over elements of type Int.
ja: この総称体where節が要求するのは、このシーケンスのためのイテレータが型Intの要素について見ていかなければなければならないことです。

source: The generic parameter Indices in angle brackets has to be a type that conforms to the Sequence protocol from the standard library.
ja: 山括弧の中の総称体パラメータIndicesは、それは標準ライブラリからのSequenceプロトコルに準拠する型でなければなりません。

source: The generic version of the function uses a placeholder type name (called T, in this case) instead of an actual type name (such as Int, String, or Double).
ja: この関数の総称体版は、プレースホルダ型名（この場合、Tと呼ばれるもの）を実際の型名（例えばInt、String、またはDouble）の代わりに使用します。

source: The getter and setter for height and width wrap access to the wrappedValue property.
ja: heightとwidthに対するゲッターとセッターは、wrappedValueプロパティへのアクセスをラップします。

source: The getter and setter requirements can be satisfied by a conforming type in a variety of ways.
ja: ゲッターとセッター要件は、準拠している型によっていろいろなやり方で満たされることができます。

source: The getter is used to read the value, and the setter is used to write the value.
ja: ゲッターが値を読むために使われます、そしてセッターが値を書くために使われます。

source: The given expression is evaluated when the function is called.
ja: 与えられた式は、関数が呼び出される時に評価されます。

source: The global and local variables you have encountered in previous chapters have all been stored variables.
ja: あなたが前の章において遭遇したグローバルおよびローカル変数は、すべて格納変数でした。

source: The grammar described here is intended to help you understand the language in more detail, rather than to allow you to directly implement a parser or compiler.
ja: ここで記述される文法は、あなたが更に詳細に言語を理解するのを手伝うつもりのもので、あなたに直ちにパーサーまたはコンパイラを実装させるようにするものではありません。

source: The grammar production above is equivalent to the following two productions, where the alternatives are spelled out explicitly:
ja: 上の文法導出は以下の２つの導出に等しいです、そこでは代替物がそれぞれ分けて書かれます：

source: The half-open range operator also has a one-sided form that’s written with only its final value.
ja: 半開範囲演算子もまた、それの最後の値のみで記述される、片側形式を持ちます。

source: The hexadecimal fraction consists of a decimal point followed by a sequence of hexadecimal digits.
ja: 16進の小数部は、小数点に続く一連の16進の桁から成ります。

source: The hypothetical function above has two type parameters.
ja: 上の仮定の関数は、２つの型パラメータを持ちます。

source: The identifier specifies the name to be exposed to Objective-C for the entity that the objc attribute applies to.
ja: この識別子は、Objective-Cへと暴露される名前をobjc属性を適用される存在に対して指定します。

source: The identity key path refers to a whole instance, so you can use it to access and change all of the data stored in a variable in a single step.
ja: 同一性キーパスはインスタンス全体を参照します、それであなたはそれを使って、ただ一段階で変数の中に格納されたデータの全てにアクセスおよび変更できます。

source: The illustration below depicts three sets—a, b and c—with overlapping regions representing elements shared among sets.
ja: 以下の図は３つの集合—a、b、そしてc—を集合間で共有される要素を表している重なり合う領域とともに描写します。

source: The illustration below depicts two sets—a and b—with the results of various set operations represented by the shaded regions.
ja: 以下の図は、２つの集合—aとb—を網掛けの領域で表される様々な集合演算の結果とともに描写します。

source: The illustration below shows the push and pop behavior for a stack:
ja: 下のイラストは、あるスタックのプッシュおよびポップ挙動を示します：

source: The illustration below shows the results of 11111111 << 1 (which is 11111111 shifted to the left by 1 place), and 11111111 >> 1 (which is 11111111 shifted to the right by 1 place).
ja: 下のイラストは、11111111 << 1（それは、1桁だけ左へシフトされる11111111です）、そして11111111 >> 1（それは、1桁だけ右へシフトされる11111111です）の結果を示します。

source: The immediate issue is that the Shape doesn’t include an == operator as part of its protocol requirements.
ja: 当面の問題は、Shapeがそれのプロトコル要件として==演算子を含まないことです。

source: The implementation of gameDidStart(_:) shown above uses the game parameter to print some introductory information about the game that is about to be played.
ja: 上で示されるgameDidStart(_:)の実装は、gameパラメータを使って、プレイされようとしているゲームに関する若干の紹介の情報を出力します。

source: The implementation of max(_:_:) uses only functionality that all Comparable types share.
ja: max(_:_:)の実装は、全てのComparable型が共有する機能性だけを使います。

source: The implementation of the vend(itemNamed:) method uses guard statements to exit the method early and throw appropriate errors if any of the requirements for purchasing a snack aren’t met.
ja: vend(itemNamed:)メソッドの実装はguard文を使って、購入スナックに必要な何かが満たされないならば早めにそのメソッドを終了して対応するエラーをスローします。

source: The imported module must be compiled with testing enabled.
ja: インポートされたモジュールは、テストすることを可能にされてコンパイルされなければなりません。

source: The individual cases of an enumeration automatically receive the same access level as the enumeration they belong to.
ja: ある列挙の個々のケース節は、自動的にそれらが属している列挙と同じアクセス水準を与えられます。

source: The information about Accessing Properties Through Optional Chaining has been updated accordingly, and the examples of checking for method call success in Calling Methods Through Optional Chaining have been expanded to show how to check for property setting success.
ja: オプショナル連鎖を通してプロパティにアクセスするについての情報はそれを受けて更新されました、そしてオプショナル連鎖を通してメソッドを呼び出すの中のメソッド呼び出しがうまくいったかを確認する例は拡張されて、プロパティの設定がうまくいったかを確認する方法を示します。

source: The inherited version of init() functions in exactly the same way as the Food version, except that it delegates to the RecipeIngredient version of init(name: String) rather than the Food version.
ja: init()の継承された改変板は、Food版と同じ正確に方法で機能しますが、それがFood板ではなくRecipeIngredient版のinit(name: String)に委任することを除きます。

source: The init! Failable Initializer
ja: init!失敗できるイニシャライザ

source: The initialization of airports could have been written in a shorter form instead:
ja: airportsの初期化は、代わりにより短い形式で書かれることもできます：

source: The initialization of shoppingList could have been written in a shorter form instead:
ja: shoppingListの初期化は、前の代わりにより短い形式に書かれることもできます：

source: The initialization of favoriteGenres could have been written in a shorter form instead:
ja: favoriteGenresの初期化は、代わりに次のような短い形式で書かれることができます：

source: The initializer expression can’t be present in a protocol declaration, but in all other contexts, the initializer expression is optional.
ja: イニシャライザ式はプロトコル宣言に含まれることはできません、しかし全ての他の文脈ではそうではありません、イニシャライザ式は任意です。

source: The initializer expression is optional in the context of a class or structure declaration, but required elsewhere.
ja: イニシャライザ式は、クラスまたは構造体宣言の文脈では任意です、しかしその他では必須です。

source: The initializer call Celsius(37.0) is clear in its intent without the need for an argument label.
ja: イニシャライザ呼び出しCelsius(37.0)は、引数ラベルを必要としなくともその意図は明快です。

source: The initializer can then fail if the provided parameters do not match an appropriate enumeration case.
ja: このイニシャライザは、提供されたパラメータが適切な列挙ケース節に適合しないならばその時に失敗できます。

source: The initializer for City is called from within the initializer for Country.
ja: Cityのためのイニシャライザは、Countryのためにイニシャライザの内部から呼ばれます。

source: The initializer then calls the structure’s automatic memberwise initializer init(origin:size:), which stores the new origin and size values in the appropriate properties:
ja: イニシャライザはそれから、構造体の自動的なメンバー関連イニシャライザinit(origin:size:)を呼びます、それは、新しい原点とサイズ値を適切なプロパティに保管します：

source: The initializer uses the wrapped value that’s specified here, and it uses the default maximum value of 12.
ja: イニシャライザは、ここで指定されるラップ値を使います、そしてそれは省略時の最大値限の12を使います。

source: The instance of SmallNumber that wraps height is created by calling SmallNumber(wrappedValue: 1), which uses the default maximum value of 12.
ja: heightをラップするSmallNumberのインスタンスは、SmallNumber(wrappedValue: 1)を呼び出すことによって作成されます、それは省略時の最大値の12を使います。

source: The instance of SmallNumber that wraps height is created by calling SmallNumber(wrappedValue: 2, maximum: 5), and the instance that wraps width is created by calling SmallNumber(wrappedValue: 3, maximum: 4).
ja: heightをラップするSmallNumberインスタンスは、SmallNumber(wrappedValue: 2, maximum: 5)を呼び出すことによって作成されます、widthをラップするインスタンスは、SmallNumber(wrappedValue: 3, maximum: 4)を呼び出すことによって作成されます。

source: The instance that wraps width is created by calling SmallNumber(wrappedValue: 2, maximum: 9).
ja: widthをラップするインスタンスは、SmallNumber(wrappedValue: 2, maximum: 9)を呼び出すことによって作成されます。

source: The instances can then refer to each other without creating a strong reference cycle.
ja: インスタンスは、そのあと強い参照循環をつくることなくお互いに言及することができます。

source: The instances of SmallNumber that wrap height and width are created by calling SmallNumber().
ja: heightとwidthをラップするSmallNumberのインスタンスは、SmallNumber()を呼び出すことによって作成されます。

source: The instances of SmallNumber that wrap height and width are created by calling SmallNumber(wrappedValue: 1).
ja: heightとwidthをラップするSmallNumberのインスタンスは、SmallNumber(wrappedValue: 1)を呼び出すことによって作成されます。

source: The instance’s asHTML property holds a strong reference to its closure.
ja: このインスタンスのasHTMLプロパティは、それのクロージャに対する強い参照を保持します。

source: The integers start at zero and count up by one for each item; if you enumerate over a whole array, these integers match the items’ indices.
ja: その整数はゼロから始めて各項目に対して１ずつ数えていきます；あなたが配列全体をすべて列挙するならば、それらの整数はそれら項目のもつインデックスと一致します。

source: The interpolated expression can contain a string literal, but can’t contain an unescaped backslash, a carriage return, or a line feed.
ja: 差し込まれた式は、文字列リテラルを含むことができます、しかしエスケープされないバックスラッシュ、キャリッジリターン、またはラインフィードを含むことはできません。

source: The invocation function uses the C calling convention.
ja: この呼出関数はC呼出規約を使います。

source: The items in someContainer can be checked with the not equal operator (!=) to see if they’re different from each other.
ja: someContainerの中の項目は、それらがお互いと異なるかどうか見るために不等演算子（!=）を使って確認されることができます。

source: The items stored in library are still Movie and Song instances behind the scenes.
ja: libraryに格納される項目は、依然として舞台裏ではMovieとSongインスタンスです。

source: The key type of a dictionary must conform to the Swift standard library Hashable protocol.
ja: ある辞書のキーの型は、スウィフト標準ライブラリHashableプロトコルに準拠しなければなりません。

source: The key-value pairs are written as a list, separated by commas, surrounded by a pair of square brackets:
ja: 「キーと値」の対はリストとして書かれます、それはコンマで区切られ、一対の角括弧に囲まれます：

source: The largest valid index in an array is count - 1 because arrays are indexed from zero—however, when count is 0 (meaning the array is empty), there are no valid indexes.
ja: ある配列の中の最も大きい有効なインデックスはcount - 1です、なぜなら配列はゼロからインデックスをつけられるからです — しかしながら、countが0である時（配列がからであるのを意味しています）、有効なインデックスは全然ありません。

source: The last defer statement in source code order executes first.
ja: ソースコード順序での最後のdefer文は最初に実行されます。

source: The last argument, *, is required and specifies that on any other platform, the body of the if executes on the minimum deployment target specified by your target.
ja: 最後の引数*は、必要で、あらゆる他のプラットホーム上を指定します、ifの本文は、あなたの対象で指定される、最小の開発対象で実行されます。

source: The last expression in the array can be followed by an optional comma.
ja: 配列の最後の式の後に、１つの任意のコンマが続くことができます。

source: The last expression in the dictionary can be followed by an optional comma.
ja: 辞書の最後の式の後に、１つの任意のコンマが続くことができます。

source: The last four codeUnit values (240, 159, 144, 182) are a four-byte UTF-8 representation of the DOG FACE character.
ja: 最後の４つのcodeUnit値（240、159、144、182）は、DOG FACE文字の４バイトUTF-８叙述です。

source: The last part of the example above shows that Self refers to the runtime type Subclass of the value of z, not the compile-time type Superclass of the variable itself.
ja: 上の例の最後の部分は、Selfがzの値のランタイム型Subclassを参照することを示します、変数それ自体のコンパイル時型Superclassではなく。

source: The length of an NSString is based on the number of 16-bit code units within the string’s UTF-16 representation and not the number of Unicode extended grapheme clusters within the string.
ja: あるNSStringの長さは、その文字列のUTF-16表現内の16ビットコード単位の数に基づきます、その文字列内のユニコード拡張書記素クラスタの数ではありません。

source: The less specific return type information from protoFlip(_:) means that many operations that depend on type information aren’t available on the returned value.
ja: protoFlip(_:)からの具体性のより少ない戻り型情報は、型情報に依存する多くの演算が、その返された値の上で利用可能でないことを意味します。

source: The letter é can be represented as the single Unicode scalar é (LATIN SMALL LETTER E WITH ACUTE, or U+00E9).
ja: 文字éは、単一のユニコード・スカラーé（LATIN SMALL LETTER E WITH ACUTE、またはU+00E9）として表わされることが出来ます。

source: The line break after the """ that begins the multiline string literal is not part of the string.
ja: 複数行文字列リテラルを開始する"""の後のラインブレークは、その文字列の一部ではありません。

source: The line break before the """ that ends the literal is also not part of the string.
ja: リテラルの終わりの"""の前のキャリッジリターンまたはラインフィードもまた、その文字列の一部ではありません。

source: The line number on which it appears.
ja: それが現れる行番号。

source: The listing below does the same assignment, but it uses a function to create the address.
ja: 下でのコード出力は、同じ代入を行います、しかしそれはある関数を使ってアドレスを作成します。

source: The literal value 3 can be added directly to the literal value 0.14159, because number literals don’t have an explicit type in and of themselves.
ja: リテラル値3は、直接にリテラル値0.14159に加えられることができます、なぜなら数リテラルがそれら自身において明確な型を持たないためです。

source: The literal value of 3 has no explicit type in and of itself, and so an appropriate output type of Double is inferred from the presence of a floating-point literal as part of the addition.
ja: リテラル値3は明確な型をそれ自体は持ちません、それで適切な出力のDouble型は、加算部分の浮動小数点リテラルの存在から推論されます。

source: The location in memory refers to what is being accessed—for example, a variable, constant, or property.
ja: メモリ中の位置はアクセスされているのは何かを参照します — 例えば、変数、定数、またはプロパティ。

source: The logical NOT operator is a prefix operator, and appears immediately before the value it operates on, without any white space.
ja: 論理否定演算子は接頭辞演算子です、そして全く空白なしで、それが作用する値の直前に現れます。

source: The loop then ends, and control returns to the while condition to decide whether another turn is required.
ja: ループはそれから終わります、そして制御はもう１つの回が必要かどうか決めるためにwhile条件に戻ります。

source: The loop’s condition (while square < finalSquare) is the same as before, but this time it’s not evaluated until the end of the first run through the loop.
ja: ループの条件（while square < finalSquare）は前と同じものです、しかし今回それは最初のループ通り抜けの終わりまで評価されません。

source: The main difference is that during phase 1, Objective-C assigns zero or null values (such as 0 or nil) to every property.
ja: 主な違いは、段階１の間に、Objective-Cがゼロまたは無効な値（例えば0またはnil）をあらゆるプロパティに代入するということです。

source: The main difference is that optional chaining fails gracefully when the optional is nil, whereas forced unwrapping triggers a runtime error when the optional is nil.
ja: 大きな違いは、オプショナル連鎖はそのオプショナルがnilであるとき潔く失敗します、だけれども強制アンラップはそのオプショナルがnilであるとき実行時エラーの引き金となります。
